export const algorithmsInfo = {
    astar: '<strong>A*</strong> довольно распространенный алгоритм поиска пути в играх, чаще всего его применяют для поиска кратчайшего пути на графах.',
    cluster:
        '<strong>Кластеризация</strong> - чаще всего используется в области анализа данных, она предназначена для разбиения множества объектов на кластеры, которые включают в себя "похожие" объекты.<br> <br>  В данной реализации представлены три вида кластеризации: <em>метод k-средних++</em>, <em>алгоритм DBSCAN</em> и <em>иерархический алгоритм</em>.',
    genetic:
        '<strong>Генетический алгоритм</strong> - алгоритм, направленный на решение проблемы коммивояжера. Такой алгоритм имитирует естественный отбор, при котором выживают сильнейшее особи, но сохраняется разнообразие популяции. <br> <br> В конкретной реализации используется турнирный отбор особей, а также одноточечный метод их скрещивания.',
    network:
        '<strong>Нейронная сеть</strong> определяет рукописные цифры, нарисованные на холсте размером 50 на 50. Модель этой нейросети - трехслойный перцептрон (один из которых - скрытый). <br><br>В качестве алгоритма обучения используется метод обратного распространения ошибки (back propagation). Также имплементированы способы улучшения, такие как добавление узлов смещения и инициализация весов.',
    ants: '<strong>Муравьиный алгоритм</strong> - является симуляцией поведения муравьев в природе. Может использоваться как для решения задачи коммивояжёра, так и для нахождения оптимального пути (от еды до колонии муравьев). <br><br> Основным инструментом для нахождения и оптицизации пути являются ферамоны.',
    tree: '<strong>Дерево решений</strong> используется в машинном обучении. После анализа входных данных (в виде csv текста) строится дерево. <br><br> Цель состоит в том, чтобы создать модель, которая может предсказывать значения переменной на основе нескольких переменных на входе.',
}
